app/controllers/lti_registration_wips_controller.rb

  def index
    action = params[:action]
    registration_id = params[:registration_id]
    registration = Lti2Tp::Registration.find(registration_id)
    @lti_registration_wip = LtiRegistrationWip.new

    # On orig registration, first assume tenant_name == name
    timeref = Time.now.strftime('%I%M.%S')
    @lti_registration_wip.tenant_name = registration.message_type == 'registration' \
            ? "#{registration.tenant_basename}-#{timeref}" : registration.tenant_name

    @lti_registration_wip.registration_id = registration_id
    @lti_registration_wip.registration_return_url = params[:return_url]

    tcp_wrapper = JsonWrapper.new JSON.load(registration.tool_consumer_profile_json)
    @lti_registration_wip.support_email = tcp_wrapper.first_at('product_instance.support.email')
    @lti_registration_wip.product_name = tcp_wrapper.first_at('product_instance.product_info.product_name.default_value')

    @lti_registration_state = 'check_tenant'

    @lti_registration_wip.save
---
INSERT INTO `lti_registration_wips` (`created_at`, `product_name`, `registration_id`, `registration_return_url`, `support_email`, `tenant_name`, `updated_at`) VALUES ('2015-04-23 23:50:33', 'Elan/LuMoS', 119, '/lti2_tp/registrations', 'john.tibbetts@kinexis.com', 'Elan University513', '2015-04-23 23:50:33')

  def update
    @lti_registration_wip = LtiRegistrationWip.find(params[:id])
    @lti_registration_wip.tenant_name = params[:lti_registration_wip][:tenant_name]
    @lti_registration_wip.save

    registration = Lti2Tp::Registration.find(@lti_registration_wip.registration_id)
    registration.tenant_name = @lti_registration_wip.tenant_name
    registration.save
---
SELECT  `lti_registration_wips`.* FROM `lti_registration_wips`  WHERE `lti_registration_wips`.`id` = 202 LIMIT 1
UPDATE `lti_registration_wips` SET `tenant_name` = 'Elan University708', `updated_at` = '2015-04-25 14:08:10' WHERE `lti_registration_wips`.`id` = 213
UPDATE `tenants` SET `secret` = '0375489430051f0f18cabb61e27992a3', `tenant_key` = '66ff6a00-cd82-0132-5378-20c9d07c6451', `updated_at` = '2015-04-25 14:08:10' WHERE `tenants`.`id` = 118
SELECT  `tenants`.* FROM `tenants`  WHERE `tenants`.`tenant_name` = 'Elan University513'  ORDER BY `tenants`.`id` ASC LIMIT 1
UPDATE `lti2_tp_registrations` SET `status` = 'register', `tool_proxy_response` = '{\"@context\":\"http://purl.imsglobal.org/ctx/lti/v2/ToolProxyId\",\"@type\":\"ToolProxy\",\"@id\":null,\"tool_proxy_guid\":\"37b0176d89d3675e724a7ab35fc3b9e0\"}', `updated_at` = '2015-08-17 00:08:34' WHERE `lti2_tp_registrations`.`id` = 42