app/controllers/record_of_performances_controller.rb

SELECT `record_of_performances`.* FROM `record_of_performances`
---
  def index
    rops = RecordOfPerformance.all

SELECT  `record_of_performances`.* FROM `record_of_performances`  WHERE `record_of_performances`.`id` = 1 LIMIT 1
---
  def show
    id = params[:id]
    rop = RecordOfPerformance.find(id)